In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([['Anna', 23, 3],
             ['Sam', 36, 12],
             ['Bill', 33, 10],
             ['Moica', 25, 7],
             ['Lisa', 27, 7],
             ['Peter', 32, None]])

In [3]:
df[0]

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: 0, dtype: object

In [4]:
df[1]

0    23
1    36
2    33
3    25
4    27
5    32
Name: 1, dtype: int64

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
type(df[0])

pandas.core.series.Series

In [7]:
df.columns = ['name', 'age', 'expr']
df

    name  age  expr
0   Anna   23   3.0
1    Sam   36  12.0
2   Bill   33  10.0
3  Moica   25   7.0
4   Lisa   27   7.0
5  Peter   32   NaN

In [8]:
df.iloc[1, 1]

36

In [9]:
df.iloc[0:2, 0]

0    Anna
1     Sam
Name: name, dtype: object

In [10]:
df.iloc[:, 0]

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: name, dtype: object

In [11]:
df.iloc[1:3, :]

   name  age  expr
1   Sam   36  12.0
2  Bill   33  10.0

In [12]:
df['age']

0    23
1    36
2    33
3    25
4    27
5    32
Name: age, dtype: int64

In [13]:
df['name']

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: name, dtype: object

In [14]:
df['expr']

0     3.0
1    12.0
2    10.0
3     7.0
4     7.0
5     NaN
Name: expr, dtype: float64

In [15]:
df[['name','expr']]

    name  expr
0   Anna   3.0
1    Sam  12.0
2   Bill  10.0
3  Moica   7.0
4   Lisa   7.0
5  Peter   NaN

In [16]:
df.index = df['name']
df

        name  age  expr
name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0
Peter  Peter   32   NaN

In [17]:
df.loc['Peter', 'age']

32

In [18]:
df.loc['Sam':'Lisa', 'expr']

name
Sam      12.0
Bill     10.0
Moica     7.0
Lisa      7.0
Name: expr, dtype: float64

In [19]:
df.loc['Sam':'Lisa', ['age', 'expr']]

       age  expr
name
Sam     36  12.0
Bill    33  10.0
Moica   25   7.0
Lisa    27   7.0

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Anna to Peter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   expr    5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 364.0+ bytes

In [21]:
df.shape

(6, 3)

In [22]:
df.describe()

             age       expr
count   6.000000   5.000000
mean   29.333333   7.800000
std     5.085928   3.420526
min    23.000000   3.000000
25%    25.500000   7.000000
50%    29.500000   7.000000
75%    32.750000  10.000000
max    36.000000  12.000000

In [23]:
df.columns

Index(['name', 'age', 'expr'], dtype='object')

In [24]:
df.index

Index(['Anna', 'Sam', 'Bill', 'Moica', 'Lisa', 'Peter'], dtype='object', name='name')

In [25]:
df.head()

        name  age  expr
name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0

In [26]:
df.head(2)

      name  age  expr
name
Anna  Anna   23   3.0
Sam    Sam   36  12.0

In [27]:
df.tail()

        name  age  expr
name
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0
Peter  Peter   32   NaN

In [28]:
df.dropna()

        name  age  expr
name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0

In [29]:
df[df['age'] > 30]

        name  age  expr
name
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Peter  Peter   32   NaN

In [30]:
df[(df['age'] < 30) & (df['expr'] > 5)]

        name  age  expr
name
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0

In [31]:
df[(df['age'] < 25) | (df['age'] > 35)]

      name  age  expr
name
Anna  Anna   23   3.0
Sam    Sam   36  12.0

In [32]:
df['age_sq'] = df['age'] ** 2
df

        name  age  expr  age_sq
name
Anna    Anna   23   3.0     529
Sam      Sam   36  12.0    1296
Bill    Bill   33  10.0    1089
Moica  Moica   25   7.0     625
Lisa    Lisa   27   7.0     729
Peter  Peter   32   NaN    1024

In [35]:
df['status'] = "W"
df

        name  age  expr  age_sq status
name
Anna    Anna   23   3.0     529      W
Sam      Sam   36  12.0    1296      W
Bill    Bill   33  10.0    1089      W
Moica  Moica   25   7.0     625      W
Lisa    Lisa   27   7.0     729      W
Peter  Peter   32   NaN    1024      W

In [37]:
df['gender'] = [0, 1, 1, 0, 0, 1]
df

        name  age  expr  age_sq status  gender
name
Anna    Anna   23   3.0     529      W       0
Sam      Sam   36  12.0    1296      W       1
Bill    Bill   33  10.0    1089      W       1
Moica  Moica   25   7.0     625      W       0
Lisa    Lisa   27   7.0     729      W       0
Peter  Peter   32   NaN    1024      W       1

In [38]:
df['no_work'] = df['age'] - 18 - df['expr']
df

        name  age  expr  age_sq status  gender  no_work
name
Anna    Anna   23   3.0     529      W       0      2.0
Sam      Sam   36  12.0    1296      W       1      6.0
Bill    Bill   33  10.0    1089      W       1      5.0
Moica  Moica   25   7.0     625      W       0      0.0
Lisa    Lisa   27   7.0     729      W       0      2.0
Peter  Peter   32   NaN    1024      W       1      NaN